In [1]:
from scipy import stats
import pandas as pd
import numpy as np

## Question no -1

In [2]:
data = pd.read_csv(r"C:\Users\user\Downloads\Cutlets.csv")

In [3]:
data

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [7]:
data.shape

(35, 2)

In [5]:
## 1 .) null hypothesis = there is no difference in diameter of cutlets
 ##   2.)    alternative hypothesis = there is difference in diameter of cutlets
    # 3.) if p-value is greater than alpha value than null hypothesis is accepted other wise rejected

In [8]:
data.head(5)

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [9]:
## Find the p-value and the t-value two tail  test

value = stats.ttest_ind(data['Unit A'] , data['Unit B'])

In [10]:
value

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

In [12]:
## Here p-value is greater then the alpha value that is why null hypothesis accepted

# its means there is no difference in diameter of cutlets

## Question no = 2

In [68]:
## if variable are not independent then we reject the null hypothesis and accept alternative hypothesis

dataframe = pd.read_csv(r"C:\Users\user\Downloads\LabTAT.csv")

In [17]:
dataframe

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [18]:
dataframe.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [19]:
## perform analysis of variance test , find out the f-value as statistics value and p-value

f_value = stats.f_oneway(dataframe.iloc[: , 0] , dataframe.iloc[: , 1] , dataframe.iloc[: , 2] , dataframe.iloc[: , 3] )

In [20]:
f_value

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [22]:
## p-value less than the alpha value so we reject the null hypothesis

## Accept the alternative hypothesis bcz there is change

## Question no = 3

In [69]:
## if male to female buyer ratio are the same then alternative hypothesis is rejected 

df = pd.DataFrame([[50,142,131,70] , [435,1523,1356,750]] , index = ['Male' , 'Female'] , columns = ['East' , 'West' , 'North' , 'South'])

In [28]:
df

        East  West  North  South
Male      50   142    131     70
Female   435  1523   1356    750

In [29]:
from scipy.stats import chi2_contingency

In [30]:
ds = np.array([[50 , 142 , 131 , 70] , [435 , 1523 , 1356 , 750]])

In [31]:
chi_value = chi2_contingency(ds)

In [32]:
chi_value

Chi2ContingencyResult(statistic=1.595945538661058, pvalue=0.6603094907091882, dof=3, expected_freq=array([[  42.76531299,  146.81287862,  131.11756787,   72.30424052],
       [ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]]))

In [36]:
np.array(chi_value)

C:\Users\user\AppData\Local\Temp\ipykernel_15872\225026638.py:1: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray.
  np.array(chi_value)

array([1.595945538661058, 0.6603094907091882, 3,
       array([[  42.76531299,  146.81287862,  131.11756787,   72.30424052],
              [ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]])],
      dtype=object)

In [33]:
## As per result p-value greater than the alpha value so  , null hypothesis is accepted
## there is no chhange in male - female buyer ratio

## Answer no = 4

In [71]:
## if the variable are the independent anad does not change then null hyppothesis is accepted
# if p -value greater then the alpha value then it is fail to reject the null hypothesis

from scipy import stats

In [37]:
df2 = pd.read_csv(r"C:\Users\user\Downloads\Costomer+OrderForm (1).csv")

In [38]:
df2

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [39]:
df2.describe()

       Phillippines   Indonesia       Malta       India
count           300         300         300         300
unique            2           2           2           2
top      Error Free  Error Free  Error Free  Error Free
freq            271         267         269         280

In [40]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Phillippines  300 non-null    object
 1   Indonesia     300 non-null    object
 2   Malta         300 non-null    object
 3   India         300 non-null    object
dtypes: object(4)
memory usage: 9.5+ KB

In [41]:
df2.shape

(300, 4)

In [42]:
## count for error free and defective for given 4 centers

In [62]:
data1 = pd.DataFrame([[271,267,269,280] , [29,33,31,20]] , index = ['Error free' , 'Defective'] , columns = ['Phillipines' , 'Indonesia' , 'Malta' , 'India'])

In [63]:
data1

            Phillipines  Indonesia  Malta  India
Error free          271        267    269    280
Defective            29         33     31     20

In [64]:
data2 = np.array([[271,267,269,280] , [29,33,31,20]])

In [65]:
chi2_value1 = stats.chi2_contingency(data2)

In [66]:
chi2_value1

Chi2ContingencyResult(statistic=3.858960685820355, pvalue=0.2771020991233135, dof=3, expected_freq=array([[271.75, 271.75, 271.75, 271.75],
       [ 28.25,  28.25,  28.25,  28.25]]))

In [67]:
## p-value is greater then the alpha value so null hypothesis is accepted

## variable are independent